print('Давай проверим, является ли введённое тобой слово палиндромом ^_^')

def validation_word(): #Функция для валидации полученного на ввод слова
    while True:
        word = input('Введи слово сюда: ')
        if word.isalpha() and len(word) > 1:
            return word
        else:  # Если получаем невалидное значение (не буквы или 1 и менее символов), то выводим сообщение об ошибке
            print('Ну уж нет, так не пойдёт -_-\nСлово должно состоять из букв(быть больше одной буквы)')

def this_word_palindrom_is(word): #Нормализуем слово (приводим все буквы к нижнему регистру)
    normalization_word = word.lower()
    return normalization_word == ''.join(reversed(normalization_word))
# Когда слово валидно и прошло нормализацию
while True:
    word = validation_word()
    print('Хм, дай-ка подумать ... Является ли это слово палиндромом?')
    if this_word_palindrom_is(word):
        print(
            'Да!\nКстати, скрипт завершён')  # Слово палиндром - выводим соответствующее сообщение и завершаем программу
        break
    else: # Не палиндром - выводим уведомление и продолжаем
        print(' -_-\n(нет)')

# Запрашиваем у пользователя команду для выхода или ввод нового слова
    exit_validation = input(
        'Вводи "выход" для выхода\n(как угодно, ведь я добавил к функции метод lower)\nИли попробуй снова (а нужно ли оно тебе?)\nЕсли хочешь - вводи слово:')
    if exit_validation.lower() == 'выход':
        print('Серьёзно?!\nНу ладно...\nЯ не осуждаю (почти)')
        break  # Если введено слово "выход" (буквы могут быть любого регистра), завершаем программу
    elif exit_validation.isalpha() and len(exit_validation) > 1:
        print(
            'Хм\nВыглядит как слово, сейчас проверим')  # Если введено новое валидное слово, проверяем, является ли оно палиндром
        if this_word_palindrom_is(exit_validation):
            print('* _ *\nДа! Это оно!!!')  # Если новое слово это палиндром, выводим сообщение и завершаем программу
            print('Скрипт завершён')
            break
        else:  # Если нет, сообщаем об этом.
            print('Нет!\n\Это всё ещё не палиндром!\nТы точно понимаешь что это такое?\nМожет надо было выйти?')
    else:
        print('Ну уж нет, это никуда не годится Т-Т\nСлово должно состоять из букв (быть больше одной буквы)')
        # В строке выше сообщение пользователю об ошибке ввода (если получено невалидное значение)
        print('Ты ведь уже добрался до последней строчки кода 0_0')
        print('Пора бы и запомнить уже -_-')  # "Вежливо" предлагаем пользователю учесть правила ввода
